{
    "format": "layers-model",
    "generatedBy": "keras v2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "2.15.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model_6",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                22
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_9"
                        },
                        "name": "input_9",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                74
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_10"
                        },
                        "name": "input_10",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding_4",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                null
                            ],
                            "input_dim": 1894,
                            "output_dim": 200,
                            "embeddings_initializer": {
                                "module": "keras.initializers",
                                "class_name": "RandomUniform",
                                "config": {
                                    "minval": -0.05,
                                    "maxval": 0.05,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": true,
                            "input_length": null
                        },
                        "name": "embedding_4",
                        "inbound_nodes": [
                            [
                                [
                                    "input_9",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding_5",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                null
                            ],
                            "input_dim": 1894,
                            "output_dim": 200,
                            "embeddings_initializer": {
                                "module": "keras.initializers",
                                "class_name": "RandomUniform",
                                "config": {
                                    "minval": -0.05,
                                    "maxval": 0.05,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": true,
                            "input_length": null
                        },
                        "name": "embedding_5",
                        "inbound_nodes": [
                            [
                                [
                                    "input_10",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_4",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": true,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 200,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 2
                        },
                        "name": "lstm_4",
                        "inbound_nodes": [
                            [
                                [
                                    "embedding_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_5",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": true,
                            "return_state": true,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 200,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 2
                        },
                        "name": "lstm_5",
                        "inbound_nodes": [
                            [
                                [
                                    "embedding_5",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "lstm_4",
                                    0,
                                    1,
                                    {}
                                ],
                                [
                                    "lstm_4",
                                    0,
                                    2,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1894,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_2",
                        "inbound_nodes": [
                            [
                                [
                                    "lstm_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_9",
                        0,
                        0
                    ],
                    [
                        "input_10",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dense_2",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": null,
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Custom>RMSprop",
                "config": {
                    "name": "RMSprop",
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": 100,
                    "jit_compile": true,
                    "is_legacy_optimizer": false,
                    "learning_rate": 0.0010000000474974513,
                    "rho": 0.9,
                    "momentum": 0.0,
                    "epsilon": 1e-07,
                    "centered": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        200,
                        1894
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [
                        1894
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding_4/embeddings",
                    "shape": [
                        1894,
                        200
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding_5/embeddings",
                    "shape": [
                        1894,
                        200
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_4/lstm_cell/kernel",
                    "shape": [
                        200,
                        800
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_4/lstm_cell/recurrent_kernel",
                    "shape": [
                        200,
                        800
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_4/lstm_cell/bias",
                    "shape": [
                        800
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_5/lstm_cell/kernel",
                    "shape": [
                        200,
                        800
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_5/lstm_cell/recurrent_kernel",
                    "shape": [
                        200,
                        800
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_5/lstm_cell/bias",
                    "shape": [
                        800
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}